In [1]:
import pandas as pd
import numpy as np

In [10]:
v1 = np.random.randint(50,100, size=(10,5))

v1

array([[89, 72, 86, 70, 84],
       [88, 94, 92, 94, 78],
       [91, 69, 91, 85, 80],
       [55, 57, 98, 78, 67],
       [85, 69, 94, 73, 78],
       [56, 91, 66, 83, 81],
       [83, 70, 71, 81, 89],
       [66, 87, 64, 75, 77],
       [93, 68, 76, 60, 78],
       [50, 85, 90, 60, 69]])

In [ ]:
#DataFrame --- > Table

In [13]:
df = pd.DataFrame(data=v1, columns=['London', 'Dubai', 'India', 'Tokyo', 'Singapore'])

In [ ]:
/Users/arunkumarsadanandan/Desktop/DSV16Main/Pad.ipynb

   London  Dubai  India  Tokyo  Singapore
0      89     72     86     70         84
1      88     94     92     94         78
2      91     69     91     85         80
3      55     57     98     78         67
4      85     69     94     73         78
5      56     91     66     83         81
6      83     70     71     81         89
7      66     87     64     75         77
8      93     68     76     60         78
9      50     85     90     60         69

In [16]:
df.describe()

          London      Dubai      India      Tokyo  Singapore
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   75.600000  76.200000  82.800000  75.900000  78.100000
std    16.906278  12.136263  12.434718  10.754327   6.436873
min    50.000000  57.000000  64.000000  60.000000  67.000000
25%    58.500000  69.000000  72.250000  70.750000  77.250000
50%    84.000000  71.000000  88.000000  76.500000  78.000000
75%    88.750000  86.500000  91.750000  82.500000  80.750000
max    93.000000  94.000000  98.000000  94.000000  89.000000

In [22]:
df['London'].std()

16.906277598046895

In [29]:
df.columns

Index(['London', 'Dubai', 'India', 'Tokyo', 'Singapore'], dtype='object')

In [30]:
for i in df.columns:
    print(df[i].sum())

756
762
828
759
781

In [25]:
df['London'].sum()

756

In [24]:
np.sqrt(df['London'].var())

16.906277598046895

In [15]:
pd.read_csv('test.csv')

   Unnamed: 0    0    1    2    3    4
0           0  1.0  1.0  1.0  1.0  1.0
1           1  1.0  1.0  1.0  1.0  1.0
2           2  1.0  1.0  1.0  1.0  1.0
3           3  1.0  1.0  1.0  1.0  1.0
4           4  1.0  1.0  1.0  1.0  1.0
5           5  1.0  1.0  1.0  1.0  1.0
6           6  1.0  1.0  1.0  1.0  1.0
7           7  1.0  1.0  1.0  1.0  1.0
8           8  1.0  1.0  1.0  1.0  1.0
9           9  1.0  1.0  1.0  1.0  1.0